{
  "published": true,
  "date": "November 4th, 2012",
  "content": "<p>Once again up at 6am. We both had a great sleep last night. The king size bed was pretty comfortable. I feel awesome. For breakfast, there was a small bistro at the hotel where we both grabbed an egg, sausage and cheese sandwich. I also got a Sweet Orange Tea but that ended up smelling like poo. Dave didn't want to smell it.</p><p>Before we hit the road, Dave topped up the gas in the truck for $3.129/gallon for Super Unleaded. WAY cheaper than back in Ottawa!</p><p>The I-80 from Des Moines to the Nebraska border is terrible. The road is incredibly bumpy and poorly maintained. While there was no tolls this time, Dave and I agree that there probably should be if it means they fix the road.</p><p>After enduring the seemingly unending road through Nebraska (there is seriously nothing to see...incredibly boring!), we stopped in the small town of Ogallala, Nebraska for some Subway. The Subway was attached to a small gas station and convenience store that had a sign over the door that said 'Welcome to nowhere'. Wow were that correct! I think it was the emptiest, most boring place I've ever been to. It also appeared that the only place in town that had internet was the Subway as there was a lady talking to someone on Skype without headphones. Everyone could hear her conversation. Very strange. Fortunately Dave said that this was the last stop we were making in Nebraska. Thank goodness! Hopefully Colorado has something more to look at.</p><p>Before we left the hotel in the morning, we finally decided that we were gonna head towards Denver, Colorado. While driving the I-76 into Denver, we saw several tumbleweeds rolling over the highway (we even hit a couple). Pretty cool! We also got to watch the Rockies get closer and closer until we were finally right beside them. The sunset tonight was amazing. The colors coming over the mountainous background was spectacular.</p><p>For dinner we went to Jim and Nick's Bar-B-Q for some pretty damn good barbeque (and creamed spinach). We also got to try a local craft beer called <a href='http://www.drydockbrewing.com/' target='_blank'>Dry Dock Apricot Blonde</a>. Highly recommend trying both the restaurant and the beer if you get the chance.</p><p>States we visited today:</p><ul><li>Ohio</li><li>Iowa</li><li>Nebraska</li><li>Colorado</li></ul><p>Some things we noticed:</p><ul><li>Iowa has the worst roads (very bumpy and poorly maintained)</li><li>western Iowa appears to be the land of windmills (likely the Dutch influence of the area)</li><li>Nebraska has a large number of Hawks hanging out by the highway</li><li>it took us until Nebraska for someone to finally wave 'thanks' after we slowed down and moved to a different lane to let them pass</li><li><a href='http://www.pioneervillage.org/' target='_blank'>Pioneer Village</a> is apparently 'THE place your friends told you to see'</li></ul><p>Tonight we're staying in Aurora, Colorado and we're not quite sure yet where we're gonna go tomorrow, but we know that we're heading towards Salt Lake City, Utah.<i class='icon-heart'></i></p><img src='/img/2012/11/04/IMG_5312.jpg' /><img src='/img/2012/11/04/IMG_5315.jpg' /><img src='/img/2012/11/04/IMG_5325.jpg' /><img src='/img/2012/11/04/IMG_5330.jpg' /><img src='/img/2012/11/04/IMG_5335.jpg' /><img src='/img/2012/11/04/IMG_5339.jpg' /><img src='/img/2012/11/04/IMG_5349.jpg' /><img src='/img/2012/11/04/IMG_5350.jpg' /><img src='/img/2012/11/04/IMG_5362.jpg' /><img src='/img/2012/11/04/Nov4Panorama.jpg' /><img src='/img/2012/11/04/IMG_5378.jpg' /><img src='/img/2012/11/04/IMG_5388.jpg' /><img src='/img/2012/11/04/IMG_5419.jpg' /><img src='/img/2012/11/04/IMG_5429.jpg' />"
}
