{
  "published": true,
  "date": "November 6th, 2012",
  "content": "<p>Up at 7am this time. No need to rush when we're a little bit ahead of schedule. We had a decent breakfast at the hotel and grabbed a bunch of bananas for the road.</p><p>The first stop of the day was at a place called Delle City, Utah; 'Population 1 + whoever is in the parking lot'. Not much in the town except for a gas station / convenience store. When we were driving away, we could see the man's trailer behind the store...not sure I'd want to live like that. The view is nice but the loneliness would drive you batty.</p><p>We also stopped at the Bonneville Salt Flats in Utah. Not much to see except the vast field of salt. It's unlike anything we've ever seen before. Pretty cool place. Also...while we were there Palina was crouching down to look at the salt so I decided that the little bit of butt crack she had showing was the perfect place to put a small chunk of salt. She thought she got it out but about an hour or so later when we stopped for lunch, she actually found it. I was laughing...she was not.</p><p>States we visited today:</p><ul><li>Wyoming</li><li>Nevada</li><li>CALIFORNIA</li></ul><p>Things we learned today:</p><ul><li>Nevada (at the least part we drove through) isn't just desert..it's full of mountains and there's actually some vegetation areas</li></ul><p>Tonight we're staying in Auburn, California. Tomorrow we finish the drive! <i class='icon-heart'></i></p><img src='/img/2012/11/06/IMG_5715.jpg' /><img src='/img/2012/11/06/IMG_5727.jpg' /><img src='/img/2012/11/06/IMG_5732.jpg' /><img src='/img/2012/11/06/IMG_5743.jpg' /><img src='/img/2012/11/06/IMG_5753.jpg' /><img src='/img/2012/11/06/IMG_5775.jpg' /><img src='/img/2012/11/06/IMG_5783.jpg' /><img src='/img/2012/11/06/IMG_5788.jpg' /><img src='/img/2012/11/06/IMG_5789.jpg' /><img src='/img/2012/11/06/IMG_5790.jpg' /><img src='/img/2012/11/06/IMG_5791.jpg' /><img src='/img/2012/11/06/IMG_5801.jpg' /><img src='/img/2012/11/06/IMG_5813.jpg' /><img src='/img/2012/11/06/IMG_5832.jpg' /><img src='/img/2012/11/06/IMG_5841.jpg' />"
}
