{
  "published": true,
  "date": "November 5th, 2012",
  "content": "<p>Up at 6 AM once again, had a giant breakfast, saw four ADORABLE bunny rabbits in the parking lot behind the hotel and then hit the road, except the road was congested with Denver morning traffic. There was a giant lime green and shiny chrome hummer… and behind that we saw downtown Denver. We were going to stop in Denver and have a look around, but after experiencing the intense traffic, we decided we'd just stop somewhere else to explore. Loveland, Colorado was the place Dave picked for us to check out. It was a very cute town, seemed very serene and had beautiful views of the Rocky Mountains in the distance. There was also another outlet mall which was also very...interesting...some time and money was spent there as well! We then returned to the I-25 North, heading towards the Rocky Mountains.</p><p>Our next stop was in Laramie, Colorado, a town with 30,000 population. It definitely felt small! We discovered that Subways there make pizzas!</p><p>The rest of the drive was through the Rockies, which was pretty cool. The topography is pretty strange, there are lots of flat areas with nothing but rocky terrane, shrubs and some snow, and mountains all around. We also saw deer on the way, most were alive, which was nice for a change. There were also lots of strong winds though, made me very nervous, but Dave just kept on driving. We wanted to make it to Salt Lake City, Utah today but it was a long day so we ended up staying in Evanston Wyoming. It's a tiny town of 12,000, but seems very cute! We went to Suds Brothers for dinner, which was the only microbrewery in town. It had a great atmosphere and Dave says the beer was pretty good! <i class='icon-heart'></i></p><img src='/img/2012/11/05/IMG_5455.jpg' />  <img src='/img/2012/11/05/IMG_5477.jpg' /><img src='/img/2012/11/05/IMG_5482.jpg' /><img src='/img/2012/11/05/IMG_5485.jpg' /><img src='/img/2012/11/05/IMG_5499.jpg' /><img src='/img/2012/11/05/IMG_5501.jpg' /><img src='/img/2012/11/05/IMG_5512.jpg' /><img src='/img/2012/11/05/IMG_5520.jpg' /><img src='/img/2012/11/05/IMG_5525.jpg' /><img src='/img/2012/11/05/IMG_5562.jpg' /><img src='/img/2012/11/05/IMG_5572.jpg' /><img src='/img/2012/11/05/IMG_5597.jpg' /><img src='/img/2012/11/05/IMG_5603.jpg' /><img src='/img/2012/11/05/IMG_5618.jpg' /><img src='/img/2012/11/05/IMG_5659.jpg' /><img src='/img/2012/11/05/IMG_5663.jpg' /><img src='/img/2012/11/05/IMG_5666.jpg' /><img src='/img/2012/11/05/IMG_5675.jpg' /><img src='/img/2012/11/05/IMG_5695.jpg' /><img src='/img/2012/11/05/IMG_5706.jpg' /><img src='/img/2012/11/05/IMG_5707.jpg' />"
}
