{
  "published": true,
  "date": "November 3rd, 2012",
  "content": "<p>Up at 6am EST and enjoying a nice continental breakfast at the hotel, we overheard that the hotel was apparently booked solid mostly because locals were staying there since the power has been out for up to 3 days in some places. Effects of Huricane Sandy?</p><p>The weather today was a lot nicer than yesterday. Mostly sunny with some patches of clouds. Beats rain and grey skies for sure. It was also about 10 degrees Celcius warmer today compared to yesterday. Here's hoping the weather just keeps on improving ;)</p><p>Because of the nicer weather, there was a lot more for us to see. Huge pumpkin patches, extremely large flock of little birds (must have been at least a couple thousand of them), the unending stretches of farm fields and a bunch more state welcome signs (including the Indiana sign that Palina missed even though she had the camera ready to go...she just waited a bit too long before trying to take a picture). We're also fairly certain we saw someone stealing kids toys out of a ground floor window just outside of Davenport, Iowa.</p><p>Since we were making pretty good time, we decided to make a mini-stop about an hour outside of Des Moines, Iowa to go shopping at the Tanger Outlet Mall. Not a ton of stores (55 I think?) but we found a couple that we liked. Palina bought a fancy new purple purse ;)</p><p>States we visited today:</p><ul><li>Ohio</li><li>Indiana</li><li>Illinois</li><li>Iowa</li></ul><p>Some things we noticed:</p><ul><li>Illinois seems to have the nicest roads to drive on so far (nice and smooth most of the way, no toll booths, and very little construction)</li><li>the mid-western states have a LOT of farm land</li></ul><p>Tonight we're staying in Des Moines, Iowa and we're not quite sure yet where we're gonna go tomorrow. Either head south a bit to Denver, Colorado or go north to see Mount Rushmore in South Dakota. It'll be a game time decision! <i class='icon-heart'></i></p><img src='/img/2012/11/03/signs.jpg' /><img src='/img/2012/11/03/IMG_5264.jpg' /><img src='/img/2012/11/03/IMG_5229.jpg' /><img src='/img/2012/11/03/IMG_5277.jpg' /><img src='/img/2012/11/03/IMG_5237.jpg' /><img src='/img/2012/11/03/IMG_5245.jpg' /><img src='/img/2012/11/03/IMG_5265.jpg' /><img src='/img/2012/11/03/IMG_5281.jpg' /><img src='/img/2012/11/03/IMG_5262.jpg' /><img src='/img/2012/11/03/IMG_5267.jpg' /><img src='/img/2012/11/03/IMG_5288.jpg' /><img src='/img/2012/11/03/IMG_5296.jpg' />"
}
